"""Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
Пример:
- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
"""

def pro(n):
    a = []
    a.append(1)
    for i in range(1,n):
        new = a[i-1] * (i+1)
        a.append(new)
    print(a)



n = int(input())
pro(n)